{
  "title": "Scientific Paper Planner Sections",
  "sections": [
    {
      "id": "question",
      "title": "Research Question",
      "type": "text",
      "maxLength": 3000,
      "inputPlaceholder": "Start writing your research question here...",
      "instructions": {
        "title": "Formulating Your Research Question",
        "text": "A good research question drives your entire study and helps you focus your efforts. It's the foundation of scientific inquiry.\n\n---\n\n* Specify your question clearly.\n\n* Be clear about the logic. Are you asking how something is? Why it is the way it is? What gives rise to something? How it got their over time? Ask yourself which conclusions are supported by what kinds of analyses.\n\n* Explain why the question matters to the field. How will science be different after your work?\n\n* REMARK: A lot of students feel lost at this point. If so, take a paper that you admire that is similar to what you want to do it and use the **Make example from pdf/doc** to get an example close to what you want to do."
      },
      "placeholder": "Research Question:[Write it out] \n\nSignificance/Impact: [Why it matters]\n"
    },
    {
      "id": "audience",
      "title": "Target Audience",
      "type": "text",
      "maxLength": 1500,
      "inputPlaceholder": "List the target audience for your research...",
      "instructions": {
        "title": "Identifying Your Target Audience",
        "text": "Every research project needs an audience. Knowing who will read and care about your work helps you focus your approach and presentation style.\n\n---\n\n* Identify primary academic communities who would benefit most directly (e.g., \"computational neuroscience\").\n\n* For each community, note how your research might impact their work.\n\n* Then, specify 3-5 individual researchers or research groups representing your audience (specific labs or scientists).\n\n* Consider how you might tailor your presentation or methods to different audiences, and seek feedback from them early on so your project remains relevant to their interests."
      },
      "placeholder": "Target Audience/Community (research fields/disciplines):\n1. \n2. \n3. \n\nSpecific Researchers/Labs (individual scientists or groups):\n1. \n2. \n3. "
    },
    {
      "id": "hypothesis",
      "title": "Hypothesis",
      "type": "text",
      "maxLength": 2000,
      "inputPlaceholder": "Start writing your hypotheses here...",
      "instructions": {
        "title": "Hypothesis-driven Research",
        "text": "Hypothesis-driven research tests specific predictions derived from theory. It's the classic approach where you make a clear, testable guess about how things work.\n\n---\n\n* Formulate at least two distinct, testable hypotheses.\n\n* Ensure each hypothesis is specific and clearly stated.\n\n* Your experiment must be able to differentiate between these hypotheses.\n\n* Explain why distinguishing between these hypotheses matters to the field.\n\n* Explain how data can help you decide between these hypotheses.\n\n* Avoid \"HARKing\" (Hypothesizing After Results are Known). Predefine your hypotheses, and if you discover new insights, label them as exploratory or post hoc rather than rewriting your original hypotheses."
      },
      "placeholder": "Hypothesis 1: [State the first specific, testable hypothesis.]\n\nHypothesis 2: [State the second specific, testable hypothesis, distinct from H1.]\n\nWhy distinguishing these hypotheses matters:\n- \n- "
    },
    {
      "id": "needsresearch",
      "title": "Needs-Based",
      "type": "text",
      "maxLength": 2000,
      "inputPlaceholder": "Define the needs your research addresses...",
      "instructions": {
        "title": "Needs-Based Research",
        "text": "Needs-based research aims to solve practical problems rather than test theories. It focuses on developing solutions that address specific real-world challenges faced by people or systems.\n\n---\n\n* Clearly identify who needs this research (patients, clinicians, engineers, policymakers).\n\n* Explain why they need it - what specific problem are you solving?\n\n* Describe the current options/solutions and their limitations.\n\n* Define concrete success criteria - how will you know if your solution works?\n\n* Explain what specific improvement or advance your solution offers over existing approaches.\n\n* Where possible, verify that the need is genuine by consulting with stakeholders or reviewing domain-specific feedback."
      },
      "placeholder": "Who needs this research:\n\nWhy they need it (specific problem to solve):\n\nCurrent approaches and their limitations:\n\nSuccess criteria (how will you measure if your solution works):\n\nAdvantages of your proposed approach:"
    },
    {
      "id": "exploratoryresearch",
      "title": "Exploratory",
      "type": "text",
      "maxLength": 2000,
      "inputPlaceholder": "Define your exploratory approach...",
      "instructions": {
        "title": "Exploratory Research",
        "text": "Exploratory research aims to discover patterns and generate hypotheses rather than testing them. It's about finding interesting connections in data without preconceived expectations about what you'll find.\n\n---\n\n* Describe the phenomena, dataset, or system you want to explore.\n\n* List 3-5 specific patterns, relationships, or discoveries your approach might reveal.\n\n* Explain what makes this exploration novel or valuable to your field.\n\n* Describe what tools or analytical approaches you'll use for discovery.\n\n* Outline how you'll distinguish meaningful patterns from random variation (e.g., hold-out validation, cross-validation, domain expert review)."
      },
      "placeholder": "Phenomena/data/system to explore:\n\nPotential discoveries your approach might reveal:\n1. \n2. \n3. \n\nValue of this exploration to the field:\n\nAnalytical approaches for discovery:\n\nStrategy for validating findings:"
    },
    {
      "id": "relatedpapers",
      "title": "Related Papers",
      "type": "text",
      "maxLength": 2000,
      "inputPlaceholder": "List the related papers here...",
      "instructions": {
        "title": "Identifying Relevant Literature",
        "text": "Every research project builds on existing work. Finding relevant papers helps you avoid reinventing the wheel and positions your work within the scientific conversation.\n\n---\n\n* List 5 papers that test similar hypotheses or address related questions.\n\n* Explain how each paper relates to your specific research question.\n\n* Identify what gap your research will fill that these papers don't address.\n\n* Consider papers with contrasting perspectives or results to yours.\n\n* Outline your search strategy (e.g., databases and keywords) to ensure comprehensive coverage, and note how you'll handle any conflicting or divergent findings in the literature."
      },
      "placeholder": "Most similar papers that test related hypotheses:\n1. \n2. \n3. \n4. \n5. "
    },
    {
      "id": "experiment",
      "title": "Experiment",
      "type": "text",
      "maxLength": 2500,
      "inputPlaceholder": "Start designing your experiment here...",
      "instructions": {
        "title": "Experiment",
        "text": "Your experiment is how you'll actually collect data to answer your research question. A well-designed experiment gives you the best chance of getting a clear answer.\n\n---\n\n* Define your key variables (independent, dependent, controlled).\n\n* Describe your sample and justify your sample size.\n\n* Outline your data collection procedures and control conditions.\n\n* State predicted results for each hypothesis.\n\n* Identify potential confounds and how you'll address them.\n\n* Where feasible, consider preregistering your experimental protocol (e.g., on the Open Science Framework) to reduce the risk of data mining or p-hacking."
      },
      "placeholder": "Key Variables:\n- Independent: \n- Dependent: \n- Controlled: \n\nSample & Size Justification: \n\nData Collection Methods: \n\nPredicted Results: \n\nPotential Confounds & Mitigations:"
    },
    {
      "id": "existingdata",
      "title": "Acquiring Pre-existing Data",
      "type": "text",
      "maxLength": 2500,
      "inputPlaceholder": "Describe the pre-existing data you plan to use...",
      "instructions": {
        "title": "Using Pre-existing Datasets",
        "text": "Using existing datasets can save time and resources. However, it's crucial to understand where the data came from and its limitations before basing your research on it.\n\n---\n\n* Identify the specific dataset(s) and where/how you will access them.\n\n* Explain what the data was originally collected for and by whom.\n\n* Confirm you have legal rights to use the data for your purpose.\n\n* Describe what you know about data provenance and quality assurance.\n\n* Assess if the dataset contains the variables needed to answer your research question."
      },
      "placeholder": "Dataset name and source:\n\nOriginal purpose of data collection:\n\nRights/permissions to use the data:\n\nData provenance and quality information:\n\nRelevant variables in the dataset:\n\nPotential limitations of using this dataset:"
    },
    {
      "id": "theorysimulation",
      "title": "Theory/Simulation",
      "type": "text",
      "maxLength": 2500,
      "inputPlaceholder": "Describe your theoretical approach or simulation...",
      "instructions": {
        "title": "Theory/Simulation Approach",
        "text": "Theoretical frameworks and simulations allow you to explore complex systems and make predictions without requiring new experimental data collection. This approach relies on clearly stated assumptions and rigorous mathematical or computational methods.\n\n---\n\n* Clearly articulate your key assumptions and their justifications.\n\n* Explain how these assumptions relate to real-world phenomena or systems.\n\n* Describe your mathematical framework or simulation methodology in detail.\n\n* Outline your approach for solving equations or implementing simulations.\n\n* Specify how you will validate your theoretical predictions or simulation results.\n\n* Identify potential limitations of your theoretical framework or simulation.\n\n* Clarify how your work advances theoretical understanding in your field."
      },
      "placeholder": "Key Theoretical Assumptions:\n- \n- \n- \n\nRelationship to Real-world Phenomena:\n\nMathematical/Computational Framework:\n\nSolution/Simulation Approach:\n\nValidation Strategy:\n\nPotential Limitations:\n\nTheoretical Significance:"
    },
    {
      "id": "analysis",
      "title": "Data Analysis",
      "type": "text",
      "maxLength": 3000,
      "inputPlaceholder": "Start planning your data analysis here...",
      "instructions": {
        "title": "Data Analysis Plan",
        "text": "Your analysis plan describes exactly how you'll extract meaning from your data. Planning it in advance helps prevent p-hacking and increases the credibility of your findings.\n\n---\n\n* Define your data cleaning steps and exclusion criteria.\n\n* Specify your primary statistical method(s) or model(s).\n\n* Explain how your analysis will address your research question.\n\n* Describe how you'll quantify uncertainty in your results.\n\n* Outline how you'll handle any special cases (outliers, multiple comparisons, etc.).\n\n* Consider methods to control for multiple comparisons (e.g., Bonferroni or FDR), and report effect sizes to convey practical significance where appropriate.\n\n* Remain transparent about any exploratory analyses and separate them from planned analyses to avoid p-hacking."
      },
      "placeholder": "Data Cleaning & Exclusions:\n\nPrimary Analysis Method:\n\nHow Analysis Addresses Research Question:\n\nUncertainty Quantification:\n\nSpecial Cases Handling:"
    },
    {
      "id": "process",
      "title": "Process",
      "type": "text",
      "maxLength": 3000,
      "inputPlaceholder": "Outline your process, skills, and timeline...",
      "instructions": {
        "title": "Research Process",
        "text": "Research is a practical endeavor requiring specific skills, resources, and planning. This section helps you anticipate what you'll need to successfully complete your project.\n\n---\n\n* List essential skills needed and identify which ones you lack.\n\n* Name potential collaborators and their specific contributions.\n\n* Describe your plan for data/code sharing and documentation.\n\n* Outline a realistic timeline with key milestones and duration.\n\n* Identify major potential obstacles and specific contingency plans (consider the likelihood and potential impact of each risk).\n\n* Adopt open science practices where possible (e.g., version control for code, publicly accessible repositories for data) and clarify licensing or privacy constraints."
      },
      "placeholder": "Skills Needed vs. Skills I Have:\n\nCollaborators & Their Roles:\n\nData/Code Sharing Plan:\n\nTimeline & Milestones:\n\nObstacles & Contingencies:"
    },
    {
      "id": "abstract",
      "title": "Abstract",
      "type": "text",
      "maxLength": 1500,
      "inputPlaceholder": "Draft your abstract here...",
      "instructions": {
        "title": "Drafting an Abstract",
        "text": "An abstract is a mini-version of your entire paper. Writing it now helps you organize your thoughts and spot any inconsistencies in your research plan.\n\n---\n\n### Structure (Aim for 1-2 sentences per point):\n\n* **Background:** Briefly introduce the research area, identify the knowledge gap or problem, and state its significance.\n\n* **Objective/Question:** Clearly state the main research question, primary hypothesis being tested, exploration goal, or problem being solved.\n\n* **Methods:** Concisely summarize your experimental design and key procedures.\n\n* **Expected Results:** Briefly describe the anticipated findings or outcomes.\n\n* **Conclusion/Implications:** State the main takeaway message and the potential impact of your work on the field."
      },
      "placeholder": "Background: \n\nObjective/Question: \n\nMethods: \n\n(Expected) Results: \n\nConclusion/Implications: "
    }
  ]
}
